

	class CfgFunctions {
		class H {class server {class DB {};};};
		class F3Menu { tag = "F3Menu"; class Initialize { file = "F3Menu"; class OpenMenu {}; }; };
		
		class trg {class trigger {
			class spawnVehicles {};
			class spawnTrigger {};
			class setSkill {};
			class findTrgRandPos {};
			class pointSpawn {};
			class patrolGroups {};
			class inHouseSpawn {};
			class spawnCheenook {};
			class objectMapper {};
			class compositionsMap {};
			class endMission {};
			class reinfCheck {};
			class reinfSpawn {};
			class patrolHeli {};
			class reinfAir {};
			class reinfGround {};
			class spawnBlackFish {};
			class compositionsUnits {};
			class endCheck {};
			class CPUnitsSpawn {};
			class taskCreate {};
			class taskDone {};
			class taskUpdate {};
		};};
	};







// Начальная заставка
	class CfgWorlds {
		class Altis {
			author = "Девятка";
			description = "База «Девятка»"; 
			pictureMap = "misc\BG.paa";
			pictureShot = "misc\BG.paa";
			loadingTexts[]= {
				"F1 - Беруши. Одевайте их когда Дыгало кричит на вас.",
				"F2 - Оружие за спину, пригодиться на длинных дистанциях.",
				"F3 - Ваша статистика. Поднимайтесь по званию, выполняя полезные действия в команде.",
				"F4 - Ставит точку-маркер на карту. Зачистили здание - нажмите кнопку, так вы отметите на карте зачищенное здание.",
				"ALT + F4 - очень хороший способ забанить админа",
				"Mix(eR) - Это МИХЕР, а не миксер",
				"Шматко: я ставлю С4..... 2 секунды спустя, АААА БЛ****",
				"Если ваша миссия не похожа на ту, где много песков с мешками, даже не зовите меня туда",
				"Если у вас нет 14к часов в арме, даже не думайте просить выдать допуск!",
				"Grav: Уважай Ветеринаров!",
				"Когда у Дыгало не получается скриптить - 'Одно слово - Дыгало'",
				"Mr.ĎarickṦ без гуся и жизнь не та.",
				"Дыгало вор. (с) Mura",
				"Как сказали из UTF - Мы только текстурки можем менять...",
				"Мы вне политики! Поэтому на сервере ВС РФ сражается против НАТО",
				"Тут могла быть ваша реклама",
				"Флаги и Дыгало - вещи не совместимые!",
				"Если Дыгало заходит за ЦУП, то он просто на чиле, на расслабоне",
				"Карнилав любит РП, но РП не любит Карнилава",
				"Как его только не называли: Дрыгало, Дышало, Дешмало...",
				"Как положить сервер Девятки? - зайти в 15 человек.",
				"Ты сделал, конечно, все хорошо, но я все переделаю - (с) Дыгало.",
				"Когда стрельбище? - 5 минут Турецкий.",
				"Убило открытой дверью. 10 из 10",
				"Ползешь 3 часа по полю и в конце концов тебя убивает твой же снайпер",
				"Производительность: Низкие - 45 FPS. Ульра - 46 FPS...",
				"Я бежал 40 мин. на точку, пережил артобстрел, авианалет и проезжающий танк, но убился об местные лестницы",
				"Чтобы увидеть этот комментарий купите DLC",
				"Значит так, ключевая точка... Я! Стрельбище. Я! Настройка пилонов. Я! Кроме того... Я. -Да подождите, Mr.Grizzly!",
				"Дыгало дает задание Mr.Grizzly...... Mr.Grizzly спустя пару часов: 'Я устал. Я ухожу' (Ельцин).",
				"Доооооброееее утроооо VIEEEEETNAAAAAAAAAAAMMM!",
				"Можешь орать, можешь маму звать, сопли на кулак наматывать, в штаны ссать, но поставленную задачу выполни!",
				"Правило номер два: умнее прапорщика только старший прапорщик.",
				"С девочкой своей в кусты налегке бегать будете. А здесь чем больше боезапаса взяли, тем больше шансов живым вернуться.",
				"Высоко поднятая голова - подарок для снайпера.",
				"Как говорил мой дед Ахмуль, вор не тот кто вор, а тот кто Дыгало.",
				"Шматко вечно молодой, вечно трехсотый.",
				"Это последний тест - (с) Дыгало."
			};
		};
	};