
	/*
		Название: «Спавн Зоны Боевых Действий»
		Авторы: Rurix & Warsom
		Авторское право: (c) 2022 «Девятка»
		Данный скрипт был разработан, написан, протестирован специально для проекта-сервера «Девятка». Любое копирование и использование скрипта без согласия авторов запрещено!
		https://discord.gg/GPfv3qAQFX 
	*/

_k = _this # 0;

_compositonsUnitsList = 
[
	[
		["B_soldier_AR_F", [12.676, 17.013, 0],0],
		["B_engeneer_F", [0.939, 15.226, 0],0],
		["B_Soldier_TL_F", [13.696, 11.123, 0],0],
		["B_Soldier_AAA_F", [14.196, -5.68, 0],0],
		["B_Soldier_LAT2_F", [5.523, -3.407, 0],0],
		["B_Soldier_SL_F", [5.928, 0.341, 0],0],
		["B_Soldier_F", [-4.827, 14.132, 0],0],
		["B_Soldier_TL_F", [-6.112, 9.298, 0],0],
		["B_Soldier_M_F", [-9, 14.95, 4.344],0],
		["B_Soldier_M_F", [-12.5, 14.932, 4.344],0],
		["B_Soldier_AA_F", [-2.174, 2.884, 0],0],
		["B_soldier_AR_F", [-1.449, -2.066, 0],0],
		["B_Soldier_TL_F", [-8.886, 0.643, 0],0],
		["B_Soldier_GL_F", [-8.886, 0.643, 0],0],
		["B_Soldier_LAT_F", [3.551, -7.066, 0],0],
		["B_Soldier_AAT_F", [1.114, -9.357, 0],0],
		["B_Soldier_TL_F", [-1.627, -12.763, 0],0],
		["B_Soldier_UAV_06_F", [17.318, -8.509, 0],0],
		["B_medic_F", [12.824, -10.852, 0],0],
		["B_Soldier_UAV_06_medical_F", [10.858, -11.813, 0],0],
		["B_medic_F", [12.85, -15.039, 0],141.252],
		["B_engineer_F", [14.667, -14.087, 0],0],
		["B_Soldier_TL_F", [16.509, -14.122, 0],84.923],
		["B_Soldier_GL_F", [15.696, -11.629, 0],0],
		["B_Soldier_LAT2_F", [4.784, -10.79, 0.593],0],
		["B_Soldier_LAT2_F", [6.642, -12.753, 0.729],0],
		["B_Soldier_LAT2_F", [4.062, -12.459, 0.729],0],
		["B_Soldier_AA_F", [-4.625, -14.675, 15.580],180],
		["B_Soldier_AA_F", [-9.772, -14.567, 15.552],0],
		["B_support_MG_F", [-11.607, -7.004, 15.365],173.804],
		["B_support_MG_F", [-9.391, -7.12, 15.365],177.918],
		["B_support_Mort_F", [-9.391, -7.12, 15.365],177.918],
		["B_soldier_AT_F", [-4.625, -2.175, 15.581],0],
		["B_soldier_exp_F", [-12.04, -7.799, 17.889],0]
	]
	,
	[
        ["B_Soldier_SL_F", [-2, -7, 3.127],0], 
        ["B_soldier_F", [7.798, -2.191, 0],0],  
        ["B_Sharpshooter_F", [3.826, 1.278, 0],125.576],  
        ["B_support_Mort_F", [-3.026, 0.788, 0],0],  
        ["B_Soldier_TL_F", [3.759, -9.975, 3.127],0],
        ["B_soldier_AR_F", [11.434, -18.033	, 0],0],
        ["B_support_MG_F", [12.958, -11.421, 0],172.702],
        ["B_soldier_lite_F", [11.087, -11.33, 0],181.339],
        ["B_HeavyGunner	_F", [7.794, -8.096, 0],150.347],
        ["B_medic_F", [-8.764, 2.082, 0],181.339],
        ["B_static_AA_F", [-4.27, -9.778, 3.127],233.678],
        ["B_soldier_AR_F", [-11.261, -6.745, 4.344],267.324],
        ["B_soldier_AA_F", [-11.989, -3.752, 4.344],269.242],
        ["B_HeavyGunner	_F", [-7.433, -13.384, 0],0],
        ["B_soldier_lite_F", [-4.094, -17.736, 0],0],
        ["B_soldier_LAT_F", [-1.212, -17.884, 0],0],
        ["B_support_Mort_F", [2.661, -17.472, 0],0],
        ["B_soldier_ARR_F", [8, -17, 0],0],
        ["B_soldier_M_F", [9.762, -17.359, 4.140],179.815],
        ["B_soldier_M_F", [11.836, -17.155, 4.344],97.749],
        ["B_soldier_M_F", [11.927, -13.987, 4.344],92.688],
        ["B_soldier_lite_F", [-12.051, -19.995, 4.979],225.380],
        ["B_support_MG_F", [13.559, -18.542	, 4.979],228.703],	
        ["B_soldier_M_F", [-12, -17, 0.086],0],
        ["B_HeavyGunner	_F", [14.312, -5.09, 1.049],283.302],
        ["B_soldier_M_F", [14.332, -6.514, 1.049],0],
        ["B_soldier_M_F", [13.065, 5.059, 4.979],0],
        ["B_soldier_lite_F", [-12.354, 5.819, 4.979],0],
        ["B_soldier_LAT2_F", [-12.619, 8.112, 4.979],0],
        ["B_support_MG_F", [-15.17, 6.021, 1.165],0],
        ["B_support_MG_F", [-4.39, 6.021, 7.489],0.729],
        ["B_HeavyGunner_F", [-2.611, 7.277, 0.729],0],
        ["B_support_Mort_F", [-0.915, 7.313, 0.729],0],
        ["B_Soldier_unarmed_F", [1.764, 7.23, 0.729],0],
        ["B_soldier_lite_F", [3.315, 7.259	, 0.729],0],
        ["B_soldier_LAT_F", [4.815, 7.284, 0.729],0],
        ["B_soldier_LAT2_F", [11.043, 5.472, 0],0],
        ["B_soldier_LAT2_F", [10.681, 1.711, 0],0],
        ["B_medic_F", [3.046, -4.22, 0],179.473],
        ["B_soldier_LAT_F", [0.802, -1.728, 0.722],181.193],
        ["B_soldier_LAT_F", [4.414, -1.597, 0.722],179.473],
        ["B_soldier_AR_F", [4.67, -10.15, 0.602],0],
        ["B_support_GMG_F", [0.197, -9.946, 0.602],0],
        ["B_soldier_mine_F", [-1.231, -7.982, 0.722],0],
        ["B_soldier_lite_F", [-1.545, -12.483, 0.722],0],
        ["B_support_MG_F", [-5.044, -12.315, 0.722],0],
        ["B_soldier_AR_F", [-5.91, -11.319, 0],131.664],
        ["B_support_GMG_F", [-6.639, -5.524, 0.722],0],
        ["B_soldier_AR_F", [-9.924, 6.574, 0.176],218.051],
        ["B_soldier_A_F", [-12.202, -12.191, 0],0]
	]
    ,
    []
];
_compositonsUnitsList select _k;